{
  "version": 1,
  "exportedAt": "2026-01-18T02:52:29.509Z",
  "notes": [
    {
      "id": "6c6dce76-66a5-4a8c-ace4-a25446facf80",
      "book": "ROM",
      "startChapter": 1,
      "startVerse": 1,
      "endChapter": 1,
      "endVerse": 7,
      "title": "Title",
      "content": "<p>Nots go here</p>",
      "type": "note",
      "createdAt": "2026-01-17T20:05:50.152Z",
      "updatedAt": "2026-01-18T00:10:25.315Z"
    },
    {
      "id": "79876e00-aba4-4bba-a60c-12f18efbffc3",
      "book": "ROM",
      "startChapter": 1,
      "startVerse": 1,
      "endChapter": 1,
      "endVerse": 7,
      "title": "Title",
      "content": "<p>Nots go here</p>",
      "type": "sermon",
      "createdAt": "2026-01-17T20:06:42.807Z",
      "updatedAt": "2026-01-18T00:31:23.400Z"
    },
    {
      "id": "0ec0f3ff-e517-4252-9fd4-5a8744a1b245",
      "book": "ROM",
      "startChapter": 1,
      "startVerse": 1,
      "endChapter": 1,
      "endVerse": 7,
      "title": "Title",
      "content": "<p>Nots go here</p>",
      "type": "commentary",
      "createdAt": "2026-01-17T20:07:06.993Z",
      "updatedAt": "2026-01-17T20:07:19.985Z"
    },
    {
      "id": "c5ec6486-3d85-4bb0-91d4-299758e0d656",
      "book": "ROM",
      "startChapter": 1,
      "startVerse": 8,
      "endChapter": 1,
      "endVerse": 15,
      "title": "Apostle Paul: The Heart of a Missionary",
      "content": "<h1><strong>TEACHING OUTLINE</strong></h1><h2><strong>Apostle Paul: The Heart of a Missionary</strong></h2><p><em>Romans 1:8-15</em></p><p><strong>BIG IDEA: </strong>The missionary heart is not defined by strategy or talent but by a soul shaped by thanksgiving, saturated in prayer, hungry for community, weighed down by obligation, and burning with eagerness to preach.</p><p><strong>INTRODUCTION</strong></p><ul><li><p>Last week: Paul the Model Missionary—his identity, his message, his mission</p></li><li><p>This week: Paul opens his chest and shows us what beats inside</p></li><li><p>The shift: from what Paul did to why he did it</p></li><li><p>The question: Do we have the heart of a missionary—or just the vocabulary?</p></li></ul><p><strong>I. A HEART THAT THANKS GOD FOR OTHERS' FAITH (v. 8)</strong></p><ul><li><p>\"First, I thank my God through Jesus Christ for all of you\"</p></li><li><p>Paul didn't plant this church. He'd never been there. Yet he gives thanks.</p></li><li><p>Their faith was \"proclaimed in all the world\"—reputation for belief, not size</p></li><li><p>The test of a missionary heart: Can you celebrate fruit you didn't produce?</p></li><li><p><em>Key phrase: </em>\"A small heart celebrates only what it built. A missionary heart celebrates what God is doing—anywhere.\"</p></li></ul><p><strong>II. A HEART THAT LABORS IN PRAYER (vv. 9-10)</strong></p><ul><li><p>\"God is my witness... without ceasing I mention you always in my prayers\"</p></li><li><p>Paul calls God as witness—not a pious platitude, but a legal oath</p></li><li><p>\"I serve with my spirit in the gospel\"—prayer as priestly service (latreia)</p></li><li><p>The connection: preaching and praying are inseparable</p></li><li><p>His specific prayer: \"That I may come to you\" (v. 10)—not demanding, but submitting to God's will</p></li><li><p><em>Key phrase: </em>\"Prayerless mission is just activism with a Christian label.\"</p></li></ul><p><strong>III. A HEART THAT LONGS FOR MUTUAL ENCOURAGEMENT (vv. 11-12)</strong></p><ul><li><p>\"I long to see you... that we may be mutually encouraged\"</p></li><li><p>Paul's immediate self-correction: not just to give, but to receive</p></li><li><p>Even the apostle needed the faith of ordinary believers</p></li><li><p>The danger of ministry as one-way street: I teach, you learn. I give, you take.</p></li><li><p>The gospel creates community—not audiences. The gospel doesn't just save individuals—it creates a family.</p></li><li><p><em>Key phrase: </em>\"The man who has nothing to receive from others has nothing to give them.\"</p></li></ul><p><strong>IV. A HEART THAT FEELS THE WEIGHT OF OBLIGATION (v. 14)</strong></p><ul><li><p>\"I am under obligation to Greeks and barbarians, wise and foolish\"</p></li><li><p>Greek word: opheiletēs—debtor</p></li><li><p>Stott's insight: Two ways to get into debt—borrow from someone, or be entrusted with something for someone</p></li><li><p>Paul didn't borrow from the Romans. Christ entrusted him with the gospel for them.</p></li><li><p>The gospel is not our possession. It's a trust. A sacred delivery.</p></li><li><p><em>Key phrase: </em>\"We don't own the gospel. We owe it.\"</p></li><li><p>Finney's infinite calculus: souls exist forever—infinite joy or infinite suffering</p></li><li><p><em>Key phrase: </em>\"The stakes aren't high. They're infinite.\"</p></li></ul><p><strong>V. A HEART THAT BURNS WITH EAGERNESS (v. 15)</strong></p><ul><li><p>\"So I am eager to preach the gospel to you also who are in Rome\"</p></li><li><p>Three statements in vv. 14-16: \"I am obligated... I am eager... I am not ashamed\"</p></li><li><p>The modern church: optional, reluctant, embarrassed</p></li><li><p>Paul: obligated, eager, unashamed</p></li><li><p>Eagerness as the fruit of conviction—he knew the gospel's power</p></li><li><p><em>Key phrase: </em>\"Reluctance to share the gospel is not humility. It's unbelief.\"</p></li></ul><p><strong>CONCLUSION</strong></p><ul><li><p>The missionary heart: thanks, prays, longs for community, feels obligation, burns with eagerness</p></li><li><p><strong>DANGEROUS QUESTION: </strong>When was the last time you actually shared the gospel with someone—not invited them to church, but told them who Jesus is and what He did?</p></li><li><p>The world is not waiting for more strategy. It's waiting for Christians with Paul's heart.</p></li><li><p>Prayer: \"Lord, give us hearts that rejoice, pray, long, carry, and preach. Give us the heart of a missionary.\"</p></li></ul><p><strong>KEY SCRIPTURES: </strong>Romans 1:8-15; 1 Thessalonians 3:10; Acts 28:30-31; 2 Timothy 1:8</p><p><strong>MEMORY VERSE: </strong>\"I am under obligation both to Greeks and to barbarians, both to the wise and to the foolish.\" — Romans 1:14 (ESV)</p><p></p><h1><strong>FULL SERMON MANUSCRIPT</strong></h1><h2><strong>Apostle Paul: The Heart of a Missionary</strong></h2><p><em>Romans 1:8-15</em></p><p><em>First, I thank my God through Jesus Christ for all of you, because your faith is proclaimed in all the world. For God is my witness, whom I serve with my spirit in the gospel of his Son, that without ceasing I mention you always in my prayers, asking that somehow by God's will I may now at last succeed in coming to you. For I long to see you, that I may impart to you some spiritual gift to strengthen you—that is, that we may be mutually encouraged by each other's faith, both yours and mine. I do not want you to be unaware, brothers, that I have often intended to come to you (but thus far have been prevented), in order that I may reap some harvest among you as well as among the rest of the Gentiles. I am under obligation both to Greeks and to barbarians, both to the wise and to the foolish. So I am eager to preach the gospel to you also who are in Rome.</em></p><p><em>— Romans 1:8-15 (ESV)</em></p><p>Last week we met Paul the Model Missionary. We saw his identity—slave, apostle, set apart. We saw his message—gospel-centered, Word-centered, Christ-centered. We saw his mission—for God's glory, among all nations.</p><p>But today Paul does something different. He opens his chest and shows us what beats inside.</p><p>This isn't about strategy anymore. It's about the heart behind the strategy. Not what Paul did—but why he did it. Not the machinery of mission—but the fuel that drove it.</p><p>And here's what strikes me: it's easy to have the vocabulary of a missionary without having the heart. We know the right words. We can talk about the Great Commission. We can discuss contextualization and unreached people groups. But vocabulary isn't mission.</p><p>The question this passage forces on us is simple: Do we actually have the heart of a missionary? Or just the language?</p><p>Let me show you five characteristics of that heart.</p><h2><strong>I. A Heart That Thanks God for Others' Faith (v. 8)</strong></h2><p>Paul opens with thanksgiving: \"First, I thank my God through Jesus Christ for all of you, because your faith is proclaimed in all the world.\"</p><p>Now stop and consider something. Paul didn't plant the church in Rome. He'd never even visited. According to early tradition, Peter brought the gospel there first. Paul had no direct involvement in their conversion, their growth, their reputation.</p><p>And yet when he hears about them, he's overwhelmed with gratitude.</p><p>Not jealousy. Not competition. Not \"Well, I wish I'd been the one to reach them.\" Just thanksgiving.</p><p>Notice what Paul celebrates. Not their numbers. Not their building. Not their influence. Their faith. That's what made the news. People all over the empire were talking about the Roman Christians—not because they were impressive by worldly standards, but because they believed. Their trust in Jesus was so evident, so real, that it became their reputation.</p><p>Here's the test of a missionary heart: Can you celebrate fruit you didn't produce?</p><p>It's easy to thank God when your ministry grows. When your church adds members. When your efforts pay off. But can you celebrate when God moves somewhere you had nothing to do with? When another pastor's church thrives? When a different ministry reaches people you couldn't reach?</p><p>A small heart only celebrates what it built. A missionary heart celebrates what God is doing—anywhere.</p><p>Let me push this further. Our world is fractured. Politically. Racially. Denominationally. It's easy to only rejoice in \"our\" tribe. To look at what God is doing in churches that don't look like ours, that don't vote like us, that don't worship like us—and feel nothing. Or worse, feel resentful.</p><p>But the gospel creates one people. Jew and Gentile. Rich and poor. Every tribe and tongue. If God is moving there, we should thank Him—even if \"there\" makes us uncomfortable.</p><p>Do we have a heart that thanks God for others' faith? Or only for our own success?</p><h2><strong>II. A Heart That Labors in Prayer (vv. 9-10)</strong></h2><p>Paul continues: \"For God is my witness, whom I serve with my spirit in the gospel of his Son, that without ceasing I mention you always in my prayers.\"</p><p>Notice how seriously Paul takes this. He calls God as his witness. This isn't a pious platitude—\"I'll be praying for you\"—tossed off casually. It's a legal oath. Paul is saying: God Himself can verify what I'm telling you.</p><p>And what is he telling them? That he prays for them constantly. Without ceasing. Always.</p><p>Paul has never met most of these people. He doesn't know their names. He can't picture their faces. And yet he brings them before God daily.</p><p>Here's a phrase that cuts to the bone: Paul says he serves God \"with my spirit in the gospel.\" That word \"serve\" is latreia—priestly service. Paul sees his prayer life as an act of worship. Not an afterthought. Not something he does when he has time. Prayer is the ministry.</p><p>And notice—preaching and praying are inseparable in Paul's mind. He doesn't preach without praying. He doesn't pray without preaching in view. The two are woven together.</p><p>What does he pray for? Verse 10: \"That somehow by God's will I may now at last succeed in coming to you.\"</p><p>Two things stand out. First, Paul has been praying this for a long time. \"Now at last\" suggests years of asking. Delayed answers. Unfulfilled longings. But he kept praying.</p><p>Second, Paul submits his prayer to God's will. \"Somehow by God's will.\" He doesn't demand. He doesn't claim it. He asks—and trusts God's timing.</p><p>Here's the reality check. How's your prayer life? Not your prayer theology—your actual prayer life. Do you have people you pray for constantly? Do you bring the lost before God daily—by name? Or is your prayer sporadic, scattered, forgotten whenever life gets busy?</p><p>Prayerless mission is just activism with a Christian label. If we're not praying, we're not depending on God. And if we're not depending on God, we're not doing His work—we're doing ours.</p><h2><strong>III. A Heart That Longs for Mutual Encouragement (vv. 11-12)</strong></h2><p>Now watch this. Paul says: \"For I long to see you, that I may impart to you some spiritual gift to strengthen you—\"</p><p>And then he immediately corrects himself.</p><p>\"—that is, that we may be mutually encouraged by each other's faith, both yours and mine.\"</p><p>Did you catch that? Paul starts to say he wants to impart something to them. To give. To strengthen. But then he pulls back. Actually, he says, I want us to encourage each other. I need something from you too.</p><p>This is the apostle Paul. The man who wrote half the New Testament. The man who'd seen the risen Christ. The man who planted churches across the empire. And he's saying: I need your faith to strengthen me.</p><p>This is humility. Real humility. Not the false kind that denies giftedness. The true kind that recognizes need.</p><p>Here's the danger in ministry: We can become one-way streets. I teach, you learn. I give, you take. I'm the expert, you're the student. We enter every room asking, \"What can I offer?\" Never, \"What can I receive?\"</p><p>But the gospel creates community—not audiences. It creates brothers and sisters—not performers and spectators. Even leaders need to be fed. Even teachers need to learn. Even strong Christians need weaker Christians to strengthen them.</p><p>The gospel doesn't just save individuals—it creates a family.</p><p>Someone once said: \"The man who has nothing to receive from others has nothing to give them.\"</p><p>Do we long for mutual encouragement? Or do we only show up to dispense wisdom? The missionary heart is willing to receive—not just give.</p><h2><strong>IV. A Heart That Feels the Weight of Obligation (v. 14)</strong></h2><p>Verse 14: \"I am under obligation both to Greeks and to barbarians, both to the wise and to the foolish.\"</p><p>That word \"obligation\" is crucial. The Greek word is opheiletēs—debtor. Paul sees himself as someone who owes something.</p><p>Now here's where it gets interesting. John Stott made an observation that changed how I think about this. He said there are two ways to get into debt.</p><p>The first way is to borrow from someone. You take something from them. You now owe them.</p><p>The second way is to be entrusted with something for someone. A third party gives you money to deliver to someone else. You now owe it—not because you borrowed, but because you're carrying what belongs to them.</p><p>Paul didn't borrow anything from the Romans. They never gave him anything. But Christ entrusted him with the gospel—for them. The gospel didn't belong to Paul. It was a sacred delivery. A trust. And until he delivered it, he was in debt.</p><p>Let's really think about that. We don't own the gospel. We owe it.</p><p>Charles Finney once made an observation that has haunted me ever since I first encountered it.</p><p>He said: Think about what it means that souls exist forever.</p><p>If a soul is lost—separated from God for eternity—its capacity for suffering has no end. It doesn't plateau. It doesn't max out. It accumulates. Forever.</p><p>Finney put it this way: The time will come when one lost soul will have experienced more suffering than all creatures in God's universe had known at the beginning of their torment. More suffering than every war, every disease, every heartbreak in human history—combined. And that soul will be no closer to the end than when it started.</p><p>Let's really think about that.</p><p>But flip it. If a soul is saved—brought into eternal life with Christ—its capacity for joy also has no end. The time will come when one redeemed soul will experience more happiness in a single moment than all the saints in the universe did when they first entered heaven.</p><p>This is the infinite calculus of evangelism.</p><p>We're not dealing with temporary outcomes. We're not talking about whether someone has a good life or a bad life for eighty years. We're talking about forever. Unending. Without limit.</p><p>When we help turn one soul from death to life, we do an infinite amount of good. Not a lot of good. Infinite good. Immeasurable. Beyond calculation.</p><p>And when we neglect to share the gospel—when we stay silent because it's awkward, when we hold back because we're afraid of rejection, when we convince ourselves it's not our job—infinite suffering hangs in the balance. A soul that might have been reached. A life that might have been transformed. An eternity that might have been different.</p><p>One soul is worth more than all the gold in the world. All the money. All the success. All the comfort we cling to. Why? Because gold rusts. Buildings crumble. Empires fall. But souls exist forever.</p><p>This is why Paul felt the weight. This is why he called himself a debtor. He carried a burden for souls because he understood what was at stake.</p><p>The stakes aren't high. They're infinite.</p><p>Notice who Paul owes. Greeks and barbarians. Wise and foolish. The cultured and the crude. The intellectual and the uneducated. Everyone.</p><p>There's no one we can write off. No one we can say, \"They're not my type.\" The gospel is for everyone—which means we owe it to everyone.</p><p>Do we feel this obligation? Or have we treated the gospel like our private property—something we can share if we feel like it, but no big deal if we don't?</p><h2><strong>V. A Heart That Burns with Eagerness (v. 15)</strong></h2><p>Finally, verse 15: \"So I am eager to preach the gospel to you also who are in Rome.\"</p><p>Eager. Not reluctant. Not obligated in a grudging way. Eager.</p><p>Look at the three statements Paul makes in verses 14-16: \"I am obligated... I am eager... I am not ashamed.\"</p><p>Now compare that to much of the modern church: Optional... Reluctant... Embarrassed.</p><p>We treat evangelism like it's for the specially gifted. We're hesitant to bring up Jesus in conversation. We're embarrassed by the exclusive claims of Christ in a pluralistic world.</p><p>Paul was the opposite. He felt obligated—like a debtor. He was eager—leaning forward, straining to preach. And he was not ashamed—confident in the gospel's power.</p><p>Why was he eager? Because he knew what the gospel was. Verse 16 tells us: \"It is the power of God for salvation to everyone who believes.\"</p><p>Paul wasn't offering religious advice. He wasn't sharing his personal spirituality. He was carrying dynamite—God's power to rescue people from sin and death. How could he not be eager?</p><p>Think about Rome. The capital of the world. The most sophisticated city on earth. Home to philosophers, politicians, emperors. If anyone should be intimidated, it was Paul—a Jewish tentmaker from Tarsus.</p><p>But Paul had no such doubts. He was eager to preach in Rome—the capital of the world, the seat of power, the center of sophistication. He wasn't intimidated by the philosophers or the politicians or the cultural elite.</p><p>Why? Because he knew something they didn't. Caesar might sit on the throne, but Jesus was Lord. Rome might rule the world, but there was a greater kingdom. And the gospel was its power.</p><p>Here's a question that should keep us up at night: When was the last time we were eager to share the gospel? Not obligated. Not guilted into it. Eager. Enthusiastic. Burning with desire to tell someone about Jesus.</p><p>If that eagerness has faded, we need to ask why. Have we forgotten what the gospel actually is? Have we stopped believing in its power? Have we become more concerned with being liked than being faithful?</p><h2><strong>Conclusion</strong></h2><p>So here's the missionary heart. Five characteristics that marked Paul—and should mark us:</p><p>A heart that thanks God for others' faith. Celebrating what God is doing anywhere, not just in our circles.</p><p>A heart that labors in prayer. Constantly interceding, not just occasionally mentioning God's work.</p><p>A heart that longs for mutual encouragement. Willing to receive, not just to give.</p><p>A heart that feels the weight of obligation. Recognizing that the gospel is a trust, not a possession.</p><p>A heart that burns with eagerness. Eager to preach, not reluctant or ashamed.</p><p><strong>Now here's the dangerous question—and I want you to answer it honestly:</strong></p><p>When was the last time you actually shared the gospel with someone? Not invited them to church. Not posted a Bible verse on social media. Actually told someone who Jesus is and what He did. Face to face. Person to person.</p><p>If you can't remember, that's a problem. Not because you're a bad Christian. But because it reveals something about your heart.</p><p>We can have all the right theology. We can attend every service. We can know the vocabulary of mission. But if we're not actually sharing the good news with the people around us, we don't have the heart of a missionary. We have the heart of a consumer.</p><p>The world isn't waiting for more Christian strategies. It isn't impressed by our buildings or our programs or our conferences. The world is waiting for Christians who actually believe what they say they believe—and prove it by opening their mouths.</p><p>Paul wanted to come to Rome. He prayed for it. He longed for it. He felt obligated to them. He was eager to preach.</p><p>That's the heart of a missionary.</p><p>Lord, give us hearts that rejoice, pray, long, carry, and preach. Give us the heart of a missionary.</p><p>Amen.</p><p></p><h1><strong>SESSION EXTRAS</strong></h1><p><em>Small Group Discussion &amp; Personal Application</em></p><h2><strong>Key Scriptures for Study</strong></h2><p><strong>Romans 1:8-15</strong> — Paul's heart for the Roman church: thanksgiving, prayer, longing, obligation, eagerness.</p><p><strong>1 Thessalonians 3:10</strong> — \"Night and day praying earnestly that we may see your face and supply what is lacking in your faith.\" Another example of Paul's prayer life.</p><p><strong>Acts 28:30-31</strong> — Paul finally reaches Rome: \"He lived there two whole years... proclaiming the kingdom of God and teaching about the Lord Jesus Christ with all boldness.\" Prayer answered.</p><p><strong>2 Timothy 1:8</strong> — \"Do not be ashamed of the testimony about our Lord.\" Paul's exhortation to Timothy, echoing Romans 1:16.</p><p><strong>1 Corinthians 9:16</strong> — \"Woe to me if I do not preach the gospel!\" Paul's sense of compulsion.</p><p><strong>Colossians 4:2-4</strong> — Prayer for open doors and boldness in proclamation.</p><h2><strong>Discussion Questions</strong></h2><p>1. Paul thanked God for the faith of people he'd never met and a church he didn't plant. Why is it sometimes hard to celebrate spiritual fruit we didn't produce? What does that reveal about our hearts?</p><p>2. Paul called God as witness that he prayed for the Romans \"without ceasing.\" How would you describe your own prayer life? Is it occasional or constant? Scattered or focused?</p><p>3. Paul corrected himself in verses 11-12—from \"imparting a gift\" to \"being mutually encouraged.\" Why do you think he made that correction? How does it challenge our approach to ministry?</p><p>4. Stott says there are two ways to get into debt: borrowing from someone, or being entrusted with something for someone. How does understanding the gospel as a \"trust\" rather than a \"possession\" change how we think about evangelism?</p><p>5. Finney argued that the worth of a soul is infinite because souls exist forever. How does this \"infinite calculus\" change how you think about sharing the gospel with one person?</p><p>6. Paul says he is \"eager\" to preach in Rome. What typically makes us reluctant or hesitant to share the gospel? How do we cultivate the kind of eagerness Paul had?</p><p><strong>7. [DANGEROUS QUESTION] </strong>When was the last time you actually shared the gospel with someone—not invited them to church, not posted a verse online, but told them face to face who Jesus is and what He did? What's stopping you?</p><p>8. If someone followed your life for a week, would they conclude you have \"the heart of a missionary\"? What would need to change?</p><h2><strong>Practical Exercise: The Missionary Heart Inventory</strong></h2><p>This week, evaluate your heart against Paul's five characteristics. Rate yourself honestly (1 = rarely/never, 5 = consistently):</p><p><strong>1. THANKSGIVING</strong> — Do I regularly thank God for what He's doing in other churches, ministries, and Christians—even outside my circle?&nbsp; ___ / 5</p><p><strong>2. PRAYER</strong> — Do I have specific people I pray for consistently—not just when I remember, but \"without ceasing\"?&nbsp; ___ / 5</p><p><strong>3. MUTUALITY</strong> — Am I willing to receive from others, not just give? Do I enter relationships expecting to learn, not just teach?&nbsp; ___ / 5</p><p><strong>4. OBLIGATION</strong> — Do I feel the weight of the gospel as a debt I owe to the world—or do I treat evangelism as optional?&nbsp; ___ / 5</p><p><strong>5. EAGERNESS</strong> — When an opportunity to share the gospel arises, am I eager or reluctant? Excited or embarrassed?&nbsp; ___ / 5</p><p><strong>Total: ___ / 25</strong></p><p>Identify your lowest score. What one step could you take this week to grow in that area?</p><h2><strong>Weekly Challenge</strong></h2><p>Choose one person in your life who doesn't know Jesus. This week:</p><p><strong>Day 1-2: </strong>Pray for them by name, daily. Ask God to open their heart and give you an opportunity.</p><p><strong>Day 3-4: </strong>Look for a natural way to connect—a conversation, a meal, a shared experience.</p><p><strong>Day 5-7: </strong>Ask God for boldness. If the door opens, walk through it. Share something of your faith—even if it's small.</p><p>At the end of the week, write down what happened. Did you pray? Did you connect? Did the door open? Did you walk through it?</p><h2><strong>Prayer Focus</strong></h2><p><em>Lord Jesus,</em></p><p><em>We confess that our hearts are often small. We celebrate only what we built. We pray sporadically. We prefer to give rather than receive. We treat the gospel as optional. We're more reluctant than eager.</em></p><p><em>Forgive us.</em></p><p><em>Give us hearts like Paul's. Hearts that thank You for what You're doing everywhere—not just in our circles. Hearts that labor in prayer, bringing the lost before You daily. Hearts that long for community, willing to receive as well as give. Hearts that feel the weight of the gospel as a sacred trust. Hearts that burn with eagerness to share the good news—regardless of the cost.</em></p><p><em>We don't want the vocabulary of mission without the heart. We don't want to know the right words and never speak them. We want to be missionaries—not in title only, but in reality.</em></p><p><em>Lord, give us the heart of a missionary.</em></p><p><em>In Jesus' name, Amen.</em></p><h2><strong>Memory Verse</strong></h2><p><strong>Romans 1:14 (ESV)</strong></p><p><em>\"I am under obligation both to Greeks and to barbarians, both to the wise and to the foolish.\"</em></p>",
      "type": "note",
      "createdAt": "2026-01-17T21:52:36.823Z",
      "updatedAt": "2026-01-17T21:53:13.725Z"
    },
    {
      "id": "496ecbbc-17f7-4cb0-ae3c-f71d0824c0fc",
      "book": "ROM",
      "startChapter": 1,
      "startVerse": 8,
      "endChapter": 1,
      "endVerse": 15,
      "title": "Title",
      "content": "<p>Nots go here</p>",
      "type": "sermon",
      "createdAt": "2026-01-17T21:53:34.954Z",
      "updatedAt": "2026-01-18T00:31:24.895Z"
    },
    {
      "id": "3103c443-0dcc-48bf-a957-cb21a744f128",
      "book": "GEN",
      "startChapter": 1,
      "startVerse": 1,
      "endChapter": 1,
      "endVerse": 1,
      "title": "Test Note from Claude Code",
      "content": "<p>This is a test note created via the MCP server after restart.</p>",
      "type": "note",
      "createdAt": "2026-01-18T00:59:36.660Z",
      "updatedAt": "2026-01-18T00:59:36.660Z"
    },
    {
      "id": "709c856d-552b-492e-bca9-861c365263e9",
      "book": "GEN",
      "startChapter": 1,
      "startVerse": 2,
      "endChapter": 1,
      "endVerse": 2,
      "title": "Test Note - Genesis 1:2",
      "content": "<p>Test note for Genesis 1:2 - verifying MCP connection to SACRED app.</p>",
      "type": "note",
      "createdAt": "2026-01-18T01:11:50.421Z",
      "updatedAt": "2026-01-18T01:11:50.421Z"
    },
    {
      "id": "ce42cab5-03c5-4fae-bc8f-481fbb649b8d",
      "book": "JHN",
      "startChapter": 1,
      "startVerse": 29,
      "endChapter": 1,
      "endVerse": 42,
      "title": "The Spirit Who Remains",
      "content": "<p><strong>The Spirit Who Remains</strong></p><p>John 1:29-42</p><p><em>Second Sunday after Epiphany — January 18, 2026</em></p><p><strong>Memory Hook: Two Titles — One Word — One Warning</strong></p><h1><strong>INTRODUCTION</strong></h1><p>The next day John saw Jesus coming toward him and made an announcement that would echo through eternity:</p><p><strong>\"Behold, the Lamb of God, who takes away the sin of the world!\"</strong></p><h2><strong>The Title We Know</strong></h2><ul><li><p>We know that title.</p></li><li><p>We sing it.</p></li><li><p>We take communion and remember the Lamb who was slain.</p></li><li><p>We read Isaiah 53 and see the Lamb led to slaughter.</p></li><li><p>The Lamb of God is woven into our worship, our hymns, our theology. The Title We've Neglected</p></li></ul><p>But John gave Jesus another title that same day.</p><p>Look at verse 33:</p><p><strong>\"He on whom you see the Spirit descend and remain, this is he who baptizes with the Holy Spirit.\"</strong></p><h2><strong>Two Titles. One Savior.</strong></h2><ul><li><p>The Lamb of God who takes away the sin of the world.</p></li><li><p>The Baptizer with the Holy Spirit.</p></li></ul><p>We have built entire traditions around the first title. Rightfully so!, but how much have we meditated on the second?</p><h3><strong><em>The Difference:</em></strong></h3><ul><li><p>The Lamb addresses our <strong>guilt</strong>—what we have done.</p></li><li><p>The Baptizer addresses our <strong>power</strong>—who we are becoming.</p></li><li><p>The Lamb is represented on Good Friday.</p></li><li><p>The Baptizer in the Holy Spirit is seen at Pentecost.</p></li></ul><h3><strong><em>The Danger of Half a Gospel:</em></strong></h3><p>You cannot have the second without the first; the Spirit is poured out only after the Lamb is slain. This is why we make the cross central.&nbsp;</p><p><strong>But if we stop at the Lamb and never get to the Baptizer, we have embraced half a gospel:</strong></p><ul><li><p>Forgiven but not filled.</p></li><li><p>Pardoned but not empowered.</p></li><li><p>Declared righteous but left to struggle in our own strength.</p></li></ul><p><strong>Today I want us to recover that second title. Because the same Jesus who died for our sins is the one who baptizes us with the Holy Spirit and power. And understanding that changes everything about how we live.</strong></p><h1><strong>I. TWO TITLES</strong></h1><h2><strong>John's Whole Ministry Built to One Moment</strong></h2><p>Verse 31:</p><p><em>\"I myself did not know him, but for this purpose I came baptizing with water, that he might be revealed to Israel.\"</em></p><h2><strong>The Sign God Gave John</strong></h2><p>John had been given a sign. God told him what to look for.</p><p>Verse 33:</p><p><em>\"He who sent me to baptize with water said to me, 'He on whom you see the Spirit descend and remain, this is he who baptizes with the Holy Spirit.'\"</em></p><h3><strong><em>Notice:</em></strong></h3><p>The sign was not just that the Spirit would descend.</p><p>The sign was that the Spirit would descend <strong><em>and remain.</em></strong></p><p><strong>The remaining was the sign.</strong></p><h2><strong>Why Does That Matter?</strong></h2><p>Because under the old covenant, the Spirit operated differently.</p><ul><li><p>He came upon people for specific tasks.</p></li><li><p>He empowered Samson for feats of strength.</p></li><li><p>He anointed Saul for kingship.</p></li><li><p>He spoke through prophets for proclamation.</p></li></ul><p>But the Spirit was rationed—given only to certain people for certain assignments.</p><p><strong>And He came and went.</strong></p><p>The Spirit rushed upon Saul, and later we read those haunting words: <em>\"The Spirit of the LORD departed from Saul.\"</em></p><h2><strong>Joel Saw a Day Coming</strong></h2><p><em>\"I will pour out my Spirit on all flesh. Your sons and your daughters shall prophesy. Even on the male and female servants in those days I will pour out my Spirit.\"</em></p><ul><li><p>Not rationed to the few, but poured out on all.</p></li><li><p>Not for isolated tasks, but for permanent indwelling.</p></li><li><p>Not coming and going, but <strong>remaining.</strong></p></li></ul><h2><strong>At the Jordan, John Sees It Happen</strong></h2><p>The Spirit descends on Jesus—<strong>and stays.</strong></p><p>Jesus is the hinge moment of redemptive history.</p><p>He is the first human being on whom the Spirit takes up permanent residence.</p><p>And He is the one who will baptize others with that same remaining Spirit.</p><h1><strong>II. ONE WORD</strong></h1><h2><strong><em>Menō</em></strong></h2><p>The Greek word John uses is <em>menō.</em></p><p>It means to abide, to stay, to take up permanent residence.</p><p>The Spirit descends and <em>menō</em> on Jesus.</p><h2><strong>Now Watch What Happens Next</strong></h2><p>In verse 35, John is standing with two of his disciples.</p><p>He sees Jesus walk by and says again, \"Behold, the Lamb of God!\"</p><p>Those two disciples leave John and follow Jesus.</p><p>Jesus turns and asks, \"What are you seeking?\"</p><p>They respond with a question: <strong>\"Rabbi, where are you staying?\"</strong></p><h3><strong><em>The Word Threaded Through:</em></strong></h3><p>Where are you <em>staying</em>?</p><p>Same word—<em>menō.</em> Where are you abiding? Where do you remain?</p><p>Jesus says, \"Come and you will see.\"</p><p>And they came and saw where he was staying, and they <em>stayed</em> with him that day. <em>Menō</em> again.</p><h3><strong><em>John Is Not Wasting Words:</em></strong></h3><ul><li><p>The Spirit <em>menō</em> on Jesus.</p></li><li><p>The disciples ask where Jesus <em>menō.</em></p></li><li><p>Then they <em>menō</em> with him.</p></li></ul><p><strong>This is intentional.</strong></p><h2><strong>Jesus Becomes the New Holy of Holies</strong></h2><p>Under the old covenant, if you wanted to draw near to God's presence, you went to a building—the tabernacle, then the temple.</p><p>The Spirit filled a location. And the Jewish people had been waiting hundreds of years for the return of God’s presence to the temple.</p><p><strong>But now the Spirit takes up permanent residence not in a structure but in a Person.</strong></p><p>So when the disciples ask, \"Where are you staying?\" and then stay with him, they are being drawn to dwell where the Spirit dwells.</p><h2><strong>But Here Is the Question</strong></h2><p>How can we stay with Jesus permanently?</p><p>He is one man in one place. And He is about to ascend to heaven.</p><h2><strong>This Is Where the Second Title Matters</strong></h2><p>Jesus is not just the one on whom the Spirit remains.</p><p><strong>He is the Baptizer with the Holy Spirit.</strong></p><p>The Spirit who remained on Him, He now pours out on us. We do not just visit Jesus—He immerses us in the same Spirit that anointed Him. He shared with us the Gifts of the Father.&nbsp;</p><h3><strong><em>A Shocking Statement:</em></strong></h3><p>This is why Jesus could say something shocking to His disciples in John 16:</p><p><strong><em>\"It is to your advantage that I go away.\"</em></strong></p><p>How could that possibly be true?</p><p>They had Jesus physically present.</p><p>And He says it is <em>better</em> that He leaves?</p><h3><strong><em>Yes.</em></strong></h3><p>Because in His humanity, Jesus was limited to one place at a time.</p><p>If He was in Jerusalem, He was not in Galilee.</p><p>But the Spirit is not bound by a body.</p><p>Christ <em>with</em> them becomes Christ <em>in</em> them.</p><p><strong>The Spirit who remained on one man at the Jordan now remains in millions across the globe.</strong></p><h2><strong>The Remaining Spirit at Work</strong></h2><p>Paul told the Corinthians—we read it this morning—that they were \"enriched in every way\" and \"not lacking in any gift.\"</p><p>That is the remaining Spirit at work.</p><p>We are temples of the Holy Spirit.</p><p><strong>The presence that once filled the Holy of Holies now fills you.</strong></p><h1><strong>III. ONE WARNING</strong></h1><h2><strong>The Spirit Descended 'Like a Dove'</strong></h2><p>Now here is where it gets practical.</p><p>The Spirit descended on Jesus \"like a dove.\"</p><p>It is a simile, a metaphor—and metaphors in Scripture are meant to be pressed.</p><p><strong>The Spirit came like a dove. Not like a pigeon.</strong></p><p>You might think those are the same bird. They are not. And the differences matter.</p><h3><strong><em>The Differences:</em></strong></h3><ul><li><p><strong>Pigeons </strong>eat garbage—whatever scraps they find on the street.<strong> Doves </strong>are selective feeders.</p></li><li><p><strong>Pigeons </strong>thrive in chaos, noise, and filth.<strong> Doves </strong>require quiet, peaceful environments and are easily startled.</p></li><li><p><strong>Pigeons </strong>are bold and assertive.<strong> Doves </strong>are gentle and timid.</p></li><li><p><strong>Pigeons </strong>can be tamed and domesticated.<strong> Doves </strong>remain wild, coming only on their own terms.</p></li><li><p><strong>Pigeons </strong>tolerate unfaithfulness.<strong> Doves </strong>mate for life.</p></li></ul><h2><strong>The Spirit Is like a Dove, Not a Pigeon</strong></h2><p>He will never leave the house—His remaining is positionally secure.</p><p>But He is a Person, not a force.</p><p><strong>And persons can be grieved.</strong></p><h3><strong><em>Two Warnings from Paul:</em></strong></h3><p><strong>Ephesians 4:30: </strong><em>\"Do not grieve the Holy Spirit of God.\"</em></p><p>You can grieve Him with sin, with bitterness, with corrupt talk, with unresolved anger.</p><p><strong>1 Thessalonians 5:19: </strong><em>\"Do not quench the Spirit.\"</em></p><p>You can quench Him by ignoring His promptings, resisting His leading, refusing to step out when He nudges.</p><h3><strong><em>The Tension:</em></strong></h3><p>The indwelling is secure. The dove does not leave the temple.</p><p><strong>But He can go quiet in a room that we have not tended to.</strong></p><p><strong>If we treat the Spirit like a pigeon—expecting Him to tolerate the garbage, the chaos, the noise—do not be surprised when the dove grows silent.</strong></p><h2><strong>So How Do We Welcome the Dove?</strong></h2><p>How do we create a habitat where He wants to dwell?</p><p><strong>1. Confess sin quickly.</strong></p><p>Do not let grieving linger. When you sense you have wounded the Spirit, deal with it now.</p><p><strong>2. Obey promptings.</strong></p><p>Do not quench the nudge. When the Spirit says speak, speak. When He says give, give. When He says go, go.</p><p><strong>3. Wait in the Word and prayer.</strong></p><p>Create a dove-friendly environment. The chaos of your life will not quiet itself. You have to carve out space.</p><p><strong>4. Ask.</strong></p><p>Jesus promised in Luke 11:13:</p><p><em>\"How much more will the heavenly Father give the Holy Spirit to those who ask!\"</em></p><p>He is not reluctant. He wants to fill. The Father delights to give the Spirit to those who ask.</p><h1><strong>CONCLUSION</strong></h1><p>The Spirit who descended at the Jordan has not left.</p><p><strong>He remains—on Christ, and now in all who belong to Christ.</strong></p><h2><strong>The Question</strong></h2><p>The question is not whether He is present.</p><p>If you are in Christ, the Spirit lives in you.</p><p><strong>The question is:</strong></p><ul><li><p>Have you welcomed His permanent presence?</p></li><li><p>Are you cultivating a life where the dove dwells comfortably?</p></li><li><p>Or have you been treating Him like a pigeon?</p></li></ul><h2><strong>The Invitation</strong></h2><p>The dove cannot be tamed.</p><p>You cannot manipulate the Spirit or put Him to work for your agenda.</p><p>But He can be welcomed. He can be honored. He can be given room to move.</p><p><strong>He remains. Will you make room for Him?</strong></p>",
      "type": "sermon",
      "createdAt": "2026-01-18T01:27:46.523Z",
      "updatedAt": "2026-01-18T01:28:00.248Z"
    },
    {
      "id": "970f27e4-5ec7-4c9e-a485-892652d1e6cf",
      "book": "JHN",
      "startChapter": 1,
      "startVerse": 29,
      "endChapter": 1,
      "endVerse": 42,
      "title": "The Spirit Who Remains - Outline",
      "content": "<h1><strong>OUTLINE: \"The Spirit Who Remains\"</strong></h1><p><strong>John 1:29-42</strong></p><p><strong>Memory Hook:</strong> Two Titles — One Word — One Warning</p><hr><h2><strong>INTRODUCTION</strong></h2><ul><li><p>John announces: \"Behold, the Lamb of God, who takes away the sin of the world!\"</p></li><li><p><strong>Two Titles for Jesus:</strong></p><ol><li><p>The Lamb of God (addresses our <strong>guilt</strong>)</p></li><li><p>The Baptizer with the Holy Spirit (addresses our <strong>power</strong>)</p></li></ol></li><li><p>The danger of half a gospel: Forgiven but not filled. Pardoned but not empowered.</p></li></ul><hr><h2><strong>I. TWO TITLES</strong></h2><ul><li><p>John's ministry built to one moment — to reveal Jesus</p></li><li><p>The sign God gave John: The Spirit would descend <strong>and remain</strong> (<em>menō</em>)</p></li><li><p>Under the old covenant, the Spirit came and went (Saul, Samson, prophets)</p></li><li><p>Joel prophesied: Spirit poured out on <strong>all flesh</strong>, not rationed</p></li><li><p>At the Jordan: Jesus is the first human on whom the Spirit takes permanent residence</p></li></ul><hr><h2><strong>II. ONE WORD</strong></h2><ul><li><p>Greek word: <strong><em>menō</em></strong> (abide, stay, remain)</p></li><li><p>The Spirit <em>menō</em> on Jesus</p></li><li><p>Disciples ask: \"Where are you <em>staying</em>?\" (<em>menō</em>)</p></li><li><p>They <em>stayed</em> with Him (<em>menō</em>)</p></li><li><p>Jesus becomes the new Holy of Holies — the Spirit dwells in a Person, not a building</p></li><li><p>Jesus as Baptizer: He pours out on us the same Spirit that anointed Him</p></li><li><p>John 16: \"It is to your advantage that I go away\" — Christ <em>with</em> them becomes Christ <em>in</em> them</p></li></ul><hr><h2><strong>III. ONE WARNING</strong></h2><ul><li><p>The Spirit descended \"like a dove\" — not a pigeon</p></li><li><p><strong>Dove vs. Pigeon:</strong></p><ul><li><p>Pigeons eat garbage; doves are selective</p></li><li><p>Pigeons thrive in chaos; doves need peace</p></li><li><p>Pigeons can be tamed; doves remain wild</p></li><li><p>Pigeons tolerate unfaithfulness; doves mate for life</p></li></ul></li><li><p>The Spirit is a Person who can be <strong>grieved</strong> (Eph 4:30) and <strong>quenched</strong> (1 Thess 5:19)</p></li><li><p><strong>How to welcome the Dove:</strong></p><ol><li><p>Confess sin quickly</p></li><li><p>Obey promptings</p></li><li><p>Wait in Word and prayer</p></li><li><p>Ask (Luke 11:13)</p></li></ol></li></ul><hr><h2><strong>CONCLUSION</strong></h2><ul><li><p>The Spirit remains — on Christ, and now in all who belong to Christ</p></li><li><p>The question: Have you welcomed His permanent presence? Are you cultivating a life where the dove dwells comfortably?</p></li><li><p><strong>He remains. Will you make room for Him?</strong></p></li></ul>",
      "type": "note",
      "createdAt": "2026-01-18T01:57:26.963Z",
      "updatedAt": "2026-01-18T01:57:26.963Z"
    }
  ]
}